SELECT tbox 'TBOX((1.0, 2000-01-01), (1.0, 2000-01-02))';
                            tbox                             
-------------------------------------------------------------
 TBOX((1,2000-01-01 00:00:00+00),(1,2000-01-02 00:00:00+00))
(1 row)

SELECT tbox 'TBOX((1.0,), (1.0,))';
      tbox       
-----------------
 TBOX((1,),(1,))
(1 row)

SELECT tbox 'TBOX((, 2000-01-01), (, 2000-01-02))';
                           tbox                            
-----------------------------------------------------------
 TBOX((,2000-01-01 00:00:00+00),(,2000-01-02 00:00:00+00))
(1 row)

SELECT tbox 'TBOX((2,2000-01-02),(1,2000-01-01))';
                            tbox                             
-------------------------------------------------------------
 TBOX((1,2000-01-01 00:00:00+00),(2,2000-01-02 00:00:00+00))
(1 row)

/* Errors */
SELECT tbox 'STBOX(1, 2000-01-02)';
ERROR:  Could not parse TBOX
LINE 2: SELECT tbox 'STBOX(1, 2000-01-02)';
                    ^
SELECT tbox 'TBOX(1, 2000-01-02)';
ERROR:  Could not parse TBOX: Missing opening parenthesis
LINE 1: SELECT tbox 'TBOX(1, 2000-01-02)';
                    ^
SELECT tbox 'TBOX((AA, 2000-01-02))';
ERROR:  Could not parse TBOX: Invalid input syntax for type double
LINE 1: SELECT tbox 'TBOX((AA, 2000-01-02))';
                    ^
SELECT tbox 'TBOX((1, AA))';
ERROR:  invalid input syntax for type timestamp with time zone: "AA"
LINE 1: SELECT tbox 'TBOX((1, AA))';
                    ^
SELECT tbox 'TBOX((1, 2000-01-01, 2))';
ERROR:  Could not parse TBOX: Missing closing parenthesis
LINE 1: SELECT tbox 'TBOX((1, 2000-01-01, 2))';
                    ^
SELECT tbox 'TBOX((1, 2000-01-01),2, 2000-01-02))';
ERROR:  Could not parse TBOX: Missing opening parenthesis
LINE 1: SELECT tbox 'TBOX((1, 2000-01-01),2, 2000-01-02))';
                    ^
SELECT tbox 'TBOX((1, 2000-01-01),(AA, 2000-01-02))';
ERROR:  Could not parse TBOX: Invalid input syntax for type double
LINE 1: SELECT tbox 'TBOX((1, 2000-01-01),(AA, 2000-01-02))';
                    ^
SELECT tbox 'TBOX((1, 2000-01-01),(2, AA))';
ERROR:  invalid input syntax for type timestamp with time zone: "AA"
LINE 1: SELECT tbox 'TBOX((1, 2000-01-01),(2, AA))';
                    ^
SELECT tbox 'TBOX((1, 2000-01-01),(2, 2000-01-02)';
ERROR:  Could not parse TBOX: Missing closing parenthesis
LINE 1: SELECT tbox 'TBOX((1, 2000-01-01),(2, 2000-01-02)';
                    ^
SELECT tbox(1,'2000-01-01',2,'2000-01-02');
                            tbox                             
-------------------------------------------------------------
 TBOX((1,2000-01-01 00:00:00+00),(2,2000-01-02 00:00:00+00))
(1 row)

SELECT tbox(2,'2000-01-02',1,'2000-01-01');
                            tbox                             
-------------------------------------------------------------
 TBOX((1,2000-01-01 00:00:00+00),(2,2000-01-02 00:00:00+00))
(1 row)

SELECT tbox(1,2);
      tbox       
-----------------
 TBOX((1,),(2,))
(1 row)

SELECT tbox(2,1);
      tbox       
-----------------
 TBOX((1,),(2,))
(1 row)

SELECT tboxt('2000-01-01','2000-01-02');
                           tboxt                           
-----------------------------------------------------------
 TBOX((,2000-01-01 00:00:00+00),(,2000-01-02 00:00:00+00))
(1 row)

SELECT tboxt('2000-01-02','2000-01-01');
                           tboxt                           
-----------------------------------------------------------
 TBOX((,2000-01-01 00:00:00+00),(,2000-01-02 00:00:00+00))
(1 row)

SELECT minValue(tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))');
 minvalue 
----------
        1
(1 row)

SELECT maxValue(tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))');
 maxvalue 
----------
        2
(1 row)

SELECT minTimestamp(tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))');
      mintimestamp      
------------------------
 2000-01-01 00:00:00+00
(1 row)

SELECT maxTimestamp(tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))');
      maxtimestamp      
------------------------
 2000-01-02 00:00:00+00
(1 row)

SELECT minValue(tbox 'TBOX((1.0,), (2.0, ))');
 minvalue 
----------
        1
(1 row)

SELECT maxValue(tbox 'TBOX((1.0,), (2.0, ))');
 maxvalue 
----------
        2
(1 row)

SELECT minTimestamp(tbox 'TBOX((1.0,), (2.0, ))');
 mintimestamp 
--------------
 
(1 row)

SELECT maxTimestamp(tbox 'TBOX((1.0,), (2.0, ))');
 maxtimestamp 
--------------
 
(1 row)

SELECT minValue(tbox 'TBOX((, 2000-01-01), (, 2000-01-02))');
 minvalue 
----------
         
(1 row)

SELECT maxValue(tbox 'TBOX((, 2000-01-01), (, 2000-01-02))');
 maxvalue 
----------
         
(1 row)

SELECT minTimestamp(tbox 'TBOX((, 2000-01-01), (, 2000-01-02))');
      mintimestamp      
------------------------
 2000-01-01 00:00:00+00
(1 row)

SELECT maxTimestamp(tbox 'TBOX((, 2000-01-01), (, 2000-01-02))');
      maxtimestamp      
------------------------
 2000-01-02 00:00:00+00
(1 row)

SELECT tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))'::floatrange;
 floatrange 
------------
 [1,2]
(1 row)

SELECT tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))'::period;
                      period                      
--------------------------------------------------
 [2000-01-01 00:00:00+00, 2000-01-02 00:00:00+00]
(1 row)

SELECT tbox 'TBOX((1.0,), (2.0, ))'::floatrange;
 floatrange 
------------
 [1,2]
(1 row)

SELECT tbox 'TBOX((1.0,), (2.0, ))'::period;
 period 
--------
 
(1 row)

SELECT tbox 'TBOX((, 2000-01-01), (, 2000-01-02))'::floatrange;
 floatrange 
------------
 
(1 row)

SELECT tbox 'TBOX((, 2000-01-01), (, 2000-01-02))'::period;
                      period                      
--------------------------------------------------
 [2000-01-01 00:00:00+00, 2000-01-02 00:00:00+00]
(1 row)

SELECT tbox_cmp(tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))', tbox 'TBOX((2.0, 2000-01-02), (1.0, 2000-01-02))');
 tbox_cmp 
----------
       -1
(1 row)

SELECT tbox_cmp(tbox 'TBOX((2.0, 2000-01-02), (1.0, 2000-01-02))', tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))');
 tbox_cmp 
----------
        1
(1 row)

SELECT tbox_cmp(tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))', tbox 'TBOX((1.0, 2000-01-03), (1.0, 2000-01-02))');
 tbox_cmp 
----------
       -1
(1 row)

SELECT tbox_cmp(tbox 'TBOX((1.0, 2000-01-03), (1.0, 2000-01-02))', tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))');
 tbox_cmp 
----------
        1
(1 row)

SELECT tbox_cmp(tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))', tbox 'TBOX((1.0, 2000-01-02), (2.0, 2000-01-02))');
 tbox_cmp 
----------
       -1
(1 row)

SELECT tbox_cmp(tbox 'TBOX((1.0, 2000-01-02), (2.0, 2000-01-02))', tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))');
 tbox_cmp 
----------
        1
(1 row)

SELECT tbox_cmp(tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))', tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-03))');
 tbox_cmp 
----------
       -1
(1 row)

SELECT tbox_cmp(tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-03))', tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))');
 tbox_cmp 
----------
        1
(1 row)

SELECT tbox_cmp(tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))', tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))');
 tbox_cmp 
----------
        0
(1 row)

SELECT tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))' = floatrange '[1, 2]'::tbox;
 ?column? 
----------
 f
(1 row)

SELECT count(*) FROM tbl_tbox t1, tbl_tbox t2 where t1.b = t2.b;
 count 
-------
    99
(1 row)

SELECT count(*) FROM tbl_tbox t1, tbl_tbox t2 where t1.b <> t2.b;
 count 
-------
  9702
(1 row)

SELECT count(*) FROM tbl_tbox t1, tbl_tbox t2 where t1.b < t2.b;
 count 
-------
  4851
(1 row)

SELECT count(*) FROM tbl_tbox t1, tbl_tbox t2 where t1.b <= t2.b;
 count 
-------
  4950
(1 row)

SELECT count(*) FROM tbl_tbox t1, tbl_tbox t2 where t1.b > t2.b;
 count 
-------
  4851
(1 row)

SELECT count(*) FROM tbl_tbox t1, tbl_tbox t2 where t1.b >= t2.b;
 count 
-------
  4950
(1 row)

SELECT count(*) FROM tbl_tfloat WHERE temp::tbox IS NOT NULL;
 count 
-------
    96
(1 row)

SELECT count(*) FROM tbl_tfloat WHERE temp::tbox IS NOT NULL;
 count 
-------
    96
(1 row)

